backend/app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2024-08-09 10:58:19.686970"], ["id", 2]]

    def set_user
      @user = User.find_by!(uuid: params[:uuid])
---
SELECT "users".* FROM "users" WHERE "users"."uuid" = $1 LIMIT $2  [["uuid", "ce6015d1-86d0-424f-9f50-f4d2a8e8e6ba"], ["LIMIT", 1]]